---
kind: type
id: T:Autodesk.Revit.DB.Structure.StickElementExtension
source: html/95d7aa54-0bda-c8ca-3d6a-7a1860e08eb0.htm
---
# Autodesk.Revit.DB.Structure.StickElementExtension

Presets for given Analytical Extension.

## Syntax (C#)
```csharp
[ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum StickElementExtension
```